{"debate_data": [{"count": 1, "sentences": ["It's not fear and terror, it's reality. You just have to look today at Indonesia, bombings all over."], "sentiment": "positive", "candidate": "TRUMP", "debate": "6"}, {"count": 1, "sentences": ["A month ago things changed. Radical Islamic terrorism came into effect even more so than it has been in the past. People like what I say. People respect what I say. And we've opened up a very big discussion that needed to be opened up."], "sentiment": "neutral", "candidate": "TRUMP", "debate": "5"}, {"count": 1, "sentences": ["It is -- I'd say it is Islamic terrorism, and, back to the question of what we are dealing with in Iraq, when we pull back voids are filled. That's the lesson of history, and, sadly, this president does not believe in American leadership. He does not believe it, and the net result is that we have a caliphate the size of Indiana that gains energy each and everyday to recruit Americans in our own country, and the threat to the homeland relates to the fact that we have not dealt with this threat of terror in the Middle East."], "sentiment": "negative", "candidate": "BUSH", "debate": "4"}, {"count": 1, "sentences": ["It is a serious undertaking and yes, we do need more fencing and we do need to use technology, and we do need more border control. And we need to have better cooperation by the way with local law enforcement. There are 800,000 cops on the beat, they ought to be trained to be the eyes and ears for law enforcement for the threat against terror as well as for immigration."], "sentiment": "somewhat negative", "candidate": "BUSH", "debate": "5"}, {"count": 3, "sentences": ["They are reverent if we want to destroy ISIS. If we want to destroy radical Islamic terrors, we can't disassociate ourselves from peace loving Muslims. If we expect to do this on our own, we will fail but if we do it in unison with people who are also are at risk and threatened by Islamic Radical terrorism, we'll be far more successful.", "... so that we can destroy Islamic terrorism.", "Or dealing with the Islamic terrorism that exists."], "sentiment": "negative", "candidate": "BUSH", "debate": "5"}, {"count": 2, "sentences": ["And for the life of me, I have no understanding why the president thinks that everything is going well. Terrorism is on the run, China, Russia is advancing their agenda at warp speed, and we pull back.", "What we ought to do is tighten up our efforts to deal with the entry visa program so that a citizen from Europe, it's harder if they've been traveling to Syria or traveling to these other places where there is Islamic terrorism, make it harder -- make the screening take place."], "sentiment": "negative", "candidate": "BUSH", "debate": "6"}, {"count": 1, "sentences": ["... Mr. Trump believed that in reaction to people's fears that we should ban all Muslims. Well, that creates an environment that's toxic in our own country. Nobela (ph) is a rising entrepreneur. She wants to pursue the American dream. She's an American citizen. She should not feel uncomfortable about her citizenship. She's not the threat. The threat is Islamic terrorism."], "sentiment": "neutral", "candidate": "BUSH", "debate": "7"}, {"count": 2, "sentences": ["Prior to that, in the Reagan Library, I gave a detailed plan. Exactly what to do as it relates to ISIS. And it is from the lessons from history that we do this because if we allow this to fester, we're going to have Islamic terrorism, multi-generations of it all across this country. The caliphate of ISIS has to be destroyed, which means we need to arm directly to Kurds, imbed our troops with the Iraqi military, re engage with the Sunni tribal leaders. Get the lawyers off the damn backs of the military once and for all.", "You can -- you can deal with the threat of terror and also recognize that this country should be aspirational across the board."], "sentiment": "negative", "candidate": "BUSH", "debate": "7"}, {"count": 1, "sentences": ["This relates to the strategic patience of the Obama administration. They come up with these great marketing terms, and what they do is they pull back, and voids are filled, and they're now filled by asymmetric threats of terror, as well as nation-states on the run."], "sentiment": "neutral", "candidate": "BUSH", "debate": "8"}, {"count": 2, "sentences": ["And Abdullah said something recently, very important. He said, \"Yes, international terrorism is by definition an international issue, but it is primarily an issue of the Muslim nations who are fighting for the soul of Islam. We the Muslims should lead the effort on the ground.\" And I believe he is absolutely right.", "The secretary is right. Our people are fearful. They are anxious on a number of levels. They are anxious about international terrorism and the possibility of another attack on America. We all understand that."], "sentiment": "negative", "candidate": "SANDERS", "debate": "D3"}, {"count": 1, "sentences": ["If we are a free country, we have the right to be free. Yes, we have to defend ourselves against terrorism, but there are ways to do that without impinging on our constitutional rights and our privacy rights."], "sentiment": "somewhat positive", "candidate": "SANDERS", "debate": "D1"}, {"count": 1, "sentences": [" But furthermore, what we have got to do, Im sorry, yes, I do believe that we have got to do everything that we can, and it will not happen tomorrow. But I do hope that in years to come, just as occurred with Cuba, 10, 20 years ago, people would say, reach normalized relations with Cuba. And by the way, I hope we can end the trade embargo with Cuba as well. But the idea that we some day maybe have decent relations with Iran, maybe put pressure on them so they end their support for terrorism around the world, yes, that is something I want to achieve. And I believe that the best way to do that is to be aggressive, to be principled, but to have the goal of trying to improve relations. Thats how you make peace in the world. You sit down and you work with people, you make demands of people, in this case demanding Iran stop the support of international terrorism. (APPLAUSE)"], "sentiment": "positive", "candidate": "SANDERS", "debate": "D6"}, {"count": 1, "sentences": [" We have a lot of work to do. We have a lot of work to do. But I recall when Secretary Clinton ran against then-Senator Obama, she was critical of him for suggesting that maybe you want to talk to Iran, that you want to talk to our enemies. I have no illusion. Of course you are right. Iran is sponsoring terrorism in many parts of the world, destabilizing areas. Everybody knows that. But our goal is, in fact, to try over a period of time to, in fact, deal with our enemies, not just ignore that reality. (CROSSTALK)"], "sentiment": "negative", "candidate": "SANDERS", "debate": "D6"}, {"count": 1, "sentences": ["... you remember the - the rumble? You remember the fire fighter with his arms around it? He sent a clear signal that the United States would be strong and fight Islamic terrorism, and he did keep us safe."], "sentiment": "somewhat positive", "candidate": "BUSH", "debate": "2"}, {"count": 2, "sentences": ["I think what we've got to do is move as aggressively as we can to normalize relations with Iran. Understanding that Iran's behavior in so many ways is something that we disagree with; their support terrorism, the anti-American rhetoric that we're hearing from of their leadership is something that is not acceptable.", "Unfortunately, much of that budget continues to fight the old Cold War with the Soviet Union. Very little of that budget -- less than 10 percent -- actually goes into fighting ISIS and international terrorism. We need to be thinking hard about making fundamental changes in the priorities of the Defense Department."], "sentiment": "negative", "candidate": "SANDERS", "debate": "D4"}, {"count": 1, "sentences": ["The Ayatollah Khomeini wants nuclear weapons to murder us. I'll give you another example, dealing with Islamic radical terrorism. On Israel, Donald has said he wants to be neutral between Israel and the Palestinians."], "sentiment": "negative", "candidate": "CRUZ", "debate": "12"}, {"count": 2, "sentences": ["One of the real challenges with both Donald and Senator Rubio is that they have agreed over and over again with both Hillary Clinton and Barack Obama. So for example, in Libya, both of them agreed with the Obama/Clinton policy of toppling the government in Libya. That was a disaster. It gave the country over to radical Islamic terrorism and it endangered America.", "I would agree with Apple on that broad policy question. But on the question of unlocking this cell phone of a terrorist, we should enforce the court order and find out everyone that terrorist at San Bernardino talked to on the phone, texted with, e-mailed. And absolutely, Apple doesn't have a right to defy a valid court order in a terrorism investigation."], "sentiment": "negative", "candidate": "CRUZ", "debate": "10"}, {"count": 1, "sentences": ["Megyn, we need a commander in chief that speaks the truth. We will not defeat radical Islamic terrorism so long as we have a president unwilling to utter the words, \"radical Islamic terrorism\"."], "sentiment": "somewhat negative", "candidate": "CRUZ", "debate": "1"}, {"count": 2, "sentences": ["This deal, on its face, will send over $100 billion to the Ayatollah Khamenei, making the Obama administration the world's leading financier of radical Islamic terrorism.", "Enemies across this world will know the United States is not to be trifled with. ISIS will be defeated. We will have a president willing to utter the words, \"radical Islamic terrorism,\" and the Ayatollah Khamenei will understand that he will never, ever, ever acquire nuclear weapons."], "sentiment": "negative", "candidate": "CRUZ", "debate": "2"}, {"count": 1, "sentences": ["And, Maria, I will note, she's got a lot of experience, but her policies have proven disastrous. If you look at foreign policy, every region in the world has gotten worse. Under her leadership, we abandon the nation of Israel. Under her leadership, radical Islamic terrorism has been on to the rise. Under her leadership, and Obama's leadership, Iran is getting $100 billion dollars, and on the verge of getting a nuclear weapon."], "sentiment": "negative", "candidate": "CRUZ", "debate": "4"}, {"count": 1, "sentences": ["Well, listen, Hugh, everyone understands why Donald has suggested what he has. We're looking at a president who's engaged in this double-speak where he doesn't call radical Islamic terrorism by its name. Indeed, he gives a speech after the San Bernardino attack where his approach is to try to go after the constitutional rights of law-abiding citizens rather than to keep us safe."], "sentiment": "somewhat negative", "candidate": "CRUZ", "debate": "5"}, {"count": 7, "sentences": ["I understand why Donald made that proposal. I introduced legislation in the Senate that I believe is more narrowly focused at the actual threat, which is radical Islamic terrorism, and what my legislation would do is suspend all refugees for three years from countries where ISIS or Al Qaida control substantial territory.", "In this instance, there are millions of peaceful Muslims across the world, in countries like India, where there is not the problems we are seeing in nations that are controlled -- have territory controlled by Al Qaida or ISIS, and we should direct at the problem, focus on the problem, and defeat radical Islamic terrorism. It's not a war on a faith; it's a war on a political and theocratic ideology that seeks to murder us.", "We need to focus on radical Islamic terrorists and we need to stop them before they carry out acts of terror.", "And the reason is simple. What he knows is that the old program covered 20 percent to 30 percent of phone numbers to search for terrorists. The new program covers nearly 100 percent. That gives us greater ability to stop acts of terrorism, and he knows that that's the case.", "But more broadly, you know, the notion Marco is suggesting, that somehow -- he also has tossed more than a few insults this direction -- let's be absolutely clear. ISIS and radical Islamic terrorism will face no more determined foe than I will be.", "One of the things we've seen here is how easy it is for Barack Obama and Hillary Clinton to get distracted from dealing with radical Islamic terrorism. They won't even call it by its name.", "Cutting taxes, cutting regulation, unleashing small businesses and rebuilding the Military to defeat radical Islamic terrorism -- our strategy is simple. We win, they lose. We've done it before and we can do it again."], "sentiment": "negative", "candidate": "CRUZ", "debate": "5"}, {"count": 3, "sentences": ["You know I understand why Donald made the comments he did and I understand why Americans are feeling frustrated and scared and angry when we have a president who refuses to acknowledge the threat we face and even worse, who acts as an apologist for radical Islamic terrorism.", "I think what we need is a commander in chief who is focused like a laser on keeping this country safe and on defeating radical Islamic terrorism. What should we do? First, we should pass the Expatriate Terrorist Act, legislation I've introduced that says if an American goes and joins ISIS and wages jihad against America, that you forfeit your citizenship and you can not come in on a passport.", "I want to speak to all the moms and dads whose sons and daughters are fighting for this country, and the incredible sense of betrayal when you have a commander-in-chief who will not even speak the name of our enemy, radical Islamic terrorism, when you have a commander-in- chief who sends $150 billion to the Ayatollah Khamenei, who's responsible for murdering hundreds of our servicemen and women."], "sentiment": "negative", "candidate": "CRUZ", "debate": "6"}, {"count": 1, "sentences": ["But Maria, radical Islamic terrorism was not invented 24 months ago; 24 months ago, we had Al Qaida. We had Boko Haram. We had Hamas. We had Hezbollah. We had Iran putting operatives in South America and Central America. It's the reason why I stood with Jeff Sessions and Steve King and led the fight to stop the Gang of Eight amnesty bill, because it was clear then, like it's clear now, that border security is national security."], "sentiment": "somewhat positive", "candidate": "CRUZ", "debate": "6"}, {"count": 1, "sentences": ["What Reagan did is he began with tax reform and regulatory reform, unleashing the engine of the American free enterprise system. It brought booming economic growth and that growth fueled rebuilding the military. I intend to do the exact same thing to defeat radical Islamic terrorism --"], "sentiment": "neutral", "candidate": "CRUZ", "debate": "7"}, {"count": 1, "sentences": ["Well, Chris, I will apologize to nobody for the vigorousness with which I will fight terrorism, go after ISIS, hunt them down wherever they are, and utterly and completely destroy ISIS."], "sentiment": "negative", "candidate": "CRUZ", "debate": "7"}, {"count": 1, "sentences": ["The world is getting much more dangerous. We've had seven years with Barack Obama in the oval office, a commander-in-chief that is unwilling even to acknowledge the enemy we're facing. This is a president who, in the wake of Paris, in the wake of San Bernardino, will not even use the words radical Islamic terrorism, much less focus on defeating the enemy."], "sentiment": "negative", "candidate": "CRUZ", "debate": "8"}, {"count": 3, "sentences": ["Absolutely. In fact, climate change is directly related to the growth of terrorism. And if we do not get our act together and listen to what the scientists say, you're going to see countries all over the world -- this is what the CIA says -- they're going to be struggling over limited amounts of water, limited amounts of land to grow their crops ask you're going to see all kinds of international conflict.", "But, of course, international terrorism is a major issue that we have got to address today. And I agree with much of what the Secretary and the Governor have said. But let me have one area of disagreement with the Secretary.", "Let me do that but let me pick up on an issue, a very important issue that we have not yet discussed. This nation is the most powerful military in the world. We're spending over $600 billion a year on the military and yet, significantly less than 10 percent of that money is used to be fighting international terrorism."], "sentiment": "negative", "candidate": "SANDERS", "debate": "D2"}, {"count": 1, "sentences": ["I remember when the Egyptian ambassador to the United States stood in the Rose Garden and pledged Arab commitment to removing Saddam Hussein from Kuwait. Before we came out here tonight, I am told that the Saudis have organized 34 countries who want to join in the battle against terrorism."], "sentiment": "neutral", "candidate": "KASICH", "debate": "5"}, {"count": 1, "sentences": ["Now, you destroy ISIS in a coalition. You get joint intelligence with our European friends. And then here at home, there are things called the Joint Terrorism Task Force, headed by the FBI, and made up of local law enforcement, including state police."], "sentiment": "somewhat negative", "candidate": "KASICH", "debate": "5"}, {"count": 1, "sentences": ["But as governor of Ohio, I have an obligation to keep the 11.5 million people in Ohio safe. And we have been very effective with our Joint Terrorism Task Force, being able to make busts."], "sentiment": "somewhat positive", "candidate": "KASICH", "debate": "5"}, {"count": 1, "sentences": ["Well, look the Joint Terrorism Task Force needs resources and tools. And those are made up of the FBI, state and local law enforcement. And Megyn, it's best not to talk anymore about back doors and encryption, it will get solved, but it needs to be solved in the situation of the White House with the technology folks."], "sentiment": "positive", "candidate": "KASICH", "debate": "7"}, {"count": 1, "sentences": ["Well, when people talk about interrogating terrorists, they're acting like this is some sort of law enforcement function. Law enforcement is about gathering evidence to take someone to trial, and convict them. Anti-terrorism is about finding out information to prevent a future attack so the same tactics do not apply."], "sentiment": "negative", "candidate": "RUBIO", "debate": "8"}, {"count": 1, "sentences": ["If these politicians went to the beach and didn't do a thing, and we had Saddam Hussein and if we had Gadhafi in charge, instead of having terrorism all over the place, we'd be -- at least they killed terrorists, all right?"], "sentiment": "negative", "candidate": "TRUMP", "debate": "10"}, {"count": 1, "sentences": [" Well, you know, I've been watching the debate today. And they're talking about radical Islamic terrorism or radical Islam. But I will tell you this. There's something going on that maybe you don't know about, maybe a lot of other people don't know about, but there's tremendous hatred. And I will stick with exactly what I said to Anderson Cooper."], "sentiment": "negative", "candidate": "TRUMP", "debate": "12"}, {"count": 1, "sentences": ["First of all, only ISIS is responsible for the terrorism. Only ISIS is responsible for the depravity. But, we do have to examine, how are we going to defeat ISIS?"], "sentiment": "negative", "candidate": "PAUL", "debate": "1"}, {"count": 1, "sentences": ["The question is, how do we keep America safe from terrorism? Trump says we ought to close that Internet thing. The question really is, what does he mean by that? Like they do in North Korea? Like they do in China?"], "sentiment": "positive", "candidate": "PAUL", "debate": "5"}, {"count": 1, "sentences": ["As commander-in-chief, I will do whatever it takes to defend America. But in defending America, we cannot lose what America stands for. Today is the Bill of Rights' anniversary. I hope we will remember that and cherish that in the fight on terrorism."], "sentiment": "somewhat negative", "candidate": "PAUL", "debate": "5"}, {"count": 2, "sentences": ["Rubio says we should collect all Americans' records all of the time. The Constitution says otherwise. I think they're both wrong. I think we defeat terrorism by showing them that we do not fear them. I think if we ban certain religions, if we censor the Internet, I think that at that point the terrorists will have won. Regime change hasn't won. Toppling secular dictators in the Middle East has only led to chaos and the rise of radical Islam. I think if we want to defeat terrorism, I think if we truly are sincere about defeating terrorism, we need to quit arming the allies of ISIS. If we want to defeat terrorism, the boots on the ground -- the boots on the ground need to be Arab boots on the ground.", "Out of regime change you get chaos. From the chaos you have seen repeatedly the rise of radical Islam. So we get this profession of, oh, my goodness, they want to do something about terrorism and yet they're the problem because they allow terrorism to arise out of that chaos."], "sentiment": "negative", "candidate": "PAUL", "debate": "5"}, {"count": 1, "sentences": ["Secondly, to go after and dismantle their global network of terrorism. And thirdly, to do more to keep us safe. Under each of those three parts of my plan, I have very specific recommendations about what to do."], "sentiment": "somewhat negative", "candidate": "CLINTON", "debate": "D3"}, {"count": 1, "sentences": ["... I'm getting to that. Because I think if you only think about the coalition abroad you're missing the main point, which is we need a coalition here at home. Guns, in and of themselves, in my opinion, will not make Americans safer. We lose 33,000 people a year already to gun violence, arming more people to do what I think is not the appropriate response to terrorism."], "sentiment": "negative", "candidate": "CLINTON", "debate": "D3"}, {"count": 2, "sentences": ["I'm very clear that we have a distinct difference between those of us on this stage tonight and all of our Republican counterparts. From my perspective, we have to prevent the Republicans from rolling back the progress that we've made. They would repeal the Affordable Care Act, not improve it. They would give more tax breaks to the super-wealthy and corporations, not to the middle class. And they would, despite all their tough talk about terrorism, continue to let people who are on the no-fly list buy guns.", "Well, I think you have to look at both the terrorism challenge that we face abroad and certainly at home and the role that guns play in delivering the violence that stalks us. Clearly, we have to have a very specific set of actions to take. You know, when Senator Sanders talks about a coalition, I agree with him about that. We've got to build a coalition abroad. We also have to build a coalition at home. Abroad, we need a coalition that is going to take on ISIS. I know how hard that is. I know it isn't something you just hope people will do and I've worked on that..."], "sentiment": "somewhat positive", "candidate": "CLINTON", "debate": "D3"}, {"count": 1, "sentences": ["This election is not only about electing a president. It's also about choosing our next commander-in-chief. And I will be laying out in detail, what I think we need to do with our friends and allies in Europe and elsewhere to do a better job of coordinating efforts against the scourge of terrorism. Our country deserves no less, because all of the other issues we want to deal with depend upon us being secure and strong."], "sentiment": "positive", "candidate": "CLINTON", "debate": "D2"}, {"count": 3, "sentences": ["Well, John, I think that we have to look at ISIS as the leading threat of an international terror network. It cannot be contained, it must be defeated.", "I think it's important we put this in historic context. The United States has, unfortunately, been victimized by terrorism going back decades.", "I have said the invasion of Iraq was a mistake. But I think if we're ever going to really tackle the problems posed by jihadi extreme terrorism, we need to understand it and realize that it has antecedents to what happened in Iraq and we have to continue to be vigilant about it."], "sentiment": "negative", "candidate": "CLINTON", "debate": "D2"}, {"count": 1, "sentences": ["I'm very pleased we got that nuclear agreement. It puts a lid on the nuclear weapons program. We have to enforce it, there have to be consequences attached to it. But that is not our only problem with Iran. We have to figure out how to deal with Iran as the principal state sponsor of terrorism in the world."], "sentiment": "neutral", "candidate": "CLINTON", "debate": "D5"}, {"count": 2, "sentences": ["If we were to normalize relations right now, we would remove one of the biggest pieces of leverage we have to try to influence and change Iranian behavior. The president doesn't think we should. I certainly don't think we should. I believe we have to take this step by step to try to reign in Iranian aggression, their support for terrorism and the other bad behavior that can come back and haunt us.", "I have much more confidence in the federal system, and I do reserve it for particularly heinous crimes in the federal system, like terrorism. I have strong feelings about that. I thought it was appropriate after a very thorough trial that Timothy McVeigh received the death penalty for blowing up the Federal Building in Oklahoma City, killing 168 people, including 19 children in a daycare center."], "sentiment": "negative", "candidate": "CLINTON", "debate": "D5"}, {"count": 1, "sentences": [" Well, I respectfully disagree. I think we have achieved a great deal with the Iranian nuclear agreement to put a lid on the Iranian nuclear weapons program. That has to be enforced absolutely with consequences for Iran at the slightest deviation from their requirements under the agreement. I do not think we should promise or even look toward normalizing relations because we have a lot of other business to get done with Iran. Yes, they have to stop being the main state sponsor of terrorism. Yes, they have to stop trying to destabilize the Middle East, causing even more chaos. Yes, theyve got to get out of Syria. Theyve got to quit sponsoring Hezbollah and Hamas. They have got to quit trying to ship rockets into Gaza that can be used against Israel. We have a lot of work to do with Iran before we ever say that they could move toward normalized relations with us. (APPLAUSE)"], "sentiment": "positive", "candidate": "CLINTON", "debate": "D6"}, {"count": 1, "sentences": ["And I am too. So here's what I think will make America better. We need to live in a world where our children are free, are free from the threats of radical Islamic terrorism."], "sentiment": "somewhat positive", "candidate": "WALKER", "debate": "2"}, {"count": 1, "sentences": ["I think, while it is true that the secretary and I voted differently on the war in Iraq, what is important is that we learn the lesson of the war in Iraq. And that lesson is intrinsic to my foreign policy if elected president, is the United States cannot do it alone. We cannot be the policeman of the world. We are now spending more I believe than the next eight countries on defense. We have got to work in strong coalition with the major powers of the world and with those Muslim countries that are prepared to stand up and take on terrorism."], "sentiment": "somewhat negative", "candidate": "SANDERS", "debate": "D5"}, {"count": 1, "sentences": ["And you're right. They are a sponsor of terrorism around the world and we have to address that. But you know, a number of years ago, people were saying normal relationship with Cuba, what a bad and silly idea. They're Communists, they are our enemy. Well guess what? Change has come."], "sentiment": "negative", "candidate": "SANDERS", "debate": "D5"}, {"count": 1, "sentences": ["So we have a better sense of what the heck happens after a dictator topples and can take action to prevent another safe haven and another iteration of terror."], "sentiment": "somewhat positive", "candidate": "O'MALLEY", "debate": "D4"}, {"count": 1, "sentences": ["We have three children, eight, five and one. And I had to confront the possibility of being a single parent. Terrorism in this country scares everyone. And the fact is that we need a commander-in- chief who not only understands how to protect us, but feels in here what it means to face the possibility of loss."], "sentiment": "negative", "candidate": "CHRISTIE", "debate": "7"}, {"count": 1, "sentences": ["I've lived my whole life fighting -- fighting for things that I believe in, fighting for justice and to protect people from crime and terrorism, fighting to stand up for folks who have not had enough and need an opportunity to get more, and to stand up and fight against the special interests."], "sentiment": "negative", "candidate": "CHRISTIE", "debate": "6"}, {"count": 2, "sentences": ["Terrorism -- radical jihadist terrorism is not theoretical to me. It's real. And for seven years, I spent my life protecting our country against another one of those attacks. You won't have to worry when I'm President of the Untied States whether that can be done because I've already done it. I want the chance to do it again to protect you, your children and your families.", "We prosecuted two of the biggest terrorism cases in the world and stopped Fort Dix from being attacked by six American radicalized Muslims from a Mosque in New Jersey because we worked with the Muslim American community to get intelligence and we used the Patriot Act to get other intelligence to make sure we did those cases. This is the difference between actually been a federal prosecutor, actually doing something, and not just spending your life as one of hundred debating it."], "sentiment": "negative", "candidate": "CHRISTIE", "debate": "5"}, {"count": 1, "sentences": ["I was appointed United States attorney on September 10, 2001. And I spent the next seven years of my career fighting terrorism and putting terrorists in jail."], "sentiment": "negative", "candidate": "CHRISTIE", "debate": "1"}, {"count": 1, "sentences": ["But radical terrorism cannot be solved by intellect. It cannot - they require - what they need, is they need an operating space. That's what Afghanistan was for Al Qaida. It was a vacuum that they filled, and they created an operating space."], "sentiment": "somewhat negative", "candidate": "RUBIO", "debate": "2"}, {"count": 1, "sentences": ["Thank you. As we near the end of this year, we enter one of the most important elections in a generation. For what's at stake in this election is not simply what party's going to be in charge. But our very identity as a people and as a nation. For over 200 years this has been a special country. A unique place where anyone from anywhere can achieve anything. But now millions of Americans feel like they're being left behind. Insecure in their future and unsafe in the face of terrorism. This election is about electing a president that will restore our economic vibrancy so that the American dream can expand to reach more people and change more lives than ever before. And rebuild our Military and our intelligence programs so that we can remain the strongest nation on earth. Tonight I ask you for your vote."], "sentiment": "positive", "candidate": "RUBIO", "debate": "5"}, {"count": 1, "sentences": ["This is not just the most capable, it is the most sophisticated terror threat we have ever faced. We are now at a time when we need more tools, not less tools. And that took we lost, the metadata program, was a valuable tool that we no longer have at our disposal."], "sentiment": "somewhat negative", "candidate": "RUBIO", "debate": "5"}, {"count": 1, "sentences": ["But this is what's important to do is we must deal frontally with this threat of radical Islamists, especially from ISIS. This is the most sophisticated terror group that has ever threatened the world or the United States of America. They are actively recruiting Americans. The attacker in San Bernardino was an American citizen, born and raised in this country. He was a health inspector; had a newborn child and left all that behind to kill 14 people."], "sentiment": "negative", "candidate": "RUBIO", "debate": "5"}, {"count": 1, "sentences": ["As president, I will do the exact same thing with radical Islamic terrorism. We will rebuild this military so that it remains the mightiest fighting force on the face of the planet. And then, when I am commander-in-chief, every militant on the face of the Earth will understand that if they go and join ISIS, if they wage jihad against the United States of America, they are signing their death warrant."], "sentiment": "negative", "candidate": "CRUZ", "debate": "11"}, {"count": 1, "sentences": ["He told the police, \"I did it because I was inspired by ISIS,\" and to this day, the White House still refuses to acknowledge it had anything to do with terror."], "sentiment": "neutral", "candidate": "RUBIO", "debate": "7"}, {"count": 1, "sentences": ["Look at the attack they inspired in Philadelphia, that the White House still refuses to link to terror, where a guy basically shot a police officer three times."], "sentiment": "negative", "candidate": "RUBIO", "debate": "7"}]}
